t = str(input("Please enter the time in the format hh:mm: "))
if len(t) > 5:
    print('Incorrect date format. Try again!')
    exit()

t = t.split(':')
hh = int(t[0])
min = int(t[1])

if hh > 25 or min > 60:
    print('Incorrect date format. Try again!')
    exit()

d_hh ={
    0 : ['двенадцать', 'первого'],
    1 : ['час', 'второго'],
    2 : ['два', 'третьего'],
    3 : ['три', 'четвертого'],
    4 : ['четыре', 'пятого'],
    5 : ['пять', 'шестого'],
    6 : ['шесть', 'седьмого'],
    7 : ['семь', 'восьмого'],
    8 : ['восемь', 'девятого'],
    9 : ['девять', 'десятого'],
    10 : ['десять', 'одинадцатого'],
    11 : ['одинадцать', 'двенадцатого'],
    12 : ['двенадцать', 'первого'],
    13 : ['час', 'второго'],
    14 : ['два', 'третьего'],
    15 : ['три', 'четвертого'],
    16 : ['четыре', 'пятого'],
    17 : ['пять', 'шестого'],
    18 : ['шесть', 'седьмого'],
    19 : ['семь', 'восьмого'],
    20 : ['восемь', 'девятого'],
    21 : ['девять', 'десятого'],
    22 : ['десять', 'одинадцатого'],
    23 : ['одинадцать', 'двенадцатого'],
    24 : ['двенадцать', 'первого'],
}

d_min = {
    1 : ['одна', 'одной'],
    2 : ['две', 'двух'],
    3 : ['три', 'трех'],
    4 : ['четыре', 'четырех'],
    5 : ['пять', 'пяти'],
    6 : ['шесть', 'шести'],
    7 : ['семь', 'семи'],
    8 : ['восемь', 'восьми'],
    9 : ['девять', 'девяти'],
    10 : ['десять', 'десяти'],
    11 : ['одинадцать','одинадцати'],
    12 : ['двенадцать', 'двенадцати'],
    13 : ['тринадцать', 'тринадцати'],
    14 : ['четырнадцать', 'четырнадцати'],
    15 : ['пятнадцать', 'пятнадцати'],
    16 : ['шестнадцать'],
    17 : ['семнадцать'],
    18 : ['восемнадцать'],
    19 : ['девятнадцать'],
    20 : ['двадцать'], 
    30 : ['тридцать'],  
    40 : ['сорок']
}

if min == 1:
    print(d_min[min][0] + ' ' + 'минута' + ' ' + d_hh[hh][1])
elif 1 < min < 5:
    print(d_min[min][0] + ' ' + 'минуты' + ' ' + d_hh[hh][1]) 
elif 5 <= min <= 20:
    print(d_min[min][0] + ' ' + 'минут' + ' '  + d_hh[hh][1])
elif 21 <= min < 30 or 30 < min < 45:
    min_1 = min // 10 * 10
    min_2 = min % 10
    if min_2 == 1 :
        print(d_min[min_1][0] + ' ' + d_min[min_2][0] + ' ' + 'минута' +' ' + d_hh[hh][1])
    elif 1 < min_2 < 5:
        print(d_min[min_1][0] + ' ' + d_min[min_2][0] + ' ' + 'минуты' + ' ' + d_hh[hh][1])
    elif min_2 == 0:
        print(d_min[min_1][0] + ' ' + 'минут' + ' ' + d_hh[hh][1])
    else:
        print(d_min[min_1][0] + ' ' + d_min[min_2][0] + ' ' + 'минут' + ' ' + d_hh[hh][1])
    
elif 45 <= min <= 59:
    min_3 = 60 - min
    if min_3 == 1:
        print('без' + ' ' + d_min[min_3][1] + ' ' + 'минуты' + ' ' + d_hh[hh+1][0])
    else:
        print('без' + ' ' + d_min[min_3][1] + ' ' + 'минут' + ' ' + d_hh[hh+1][0])

elif min == 30:
    print('половина' + ' ' + d_hh[hh][1])

elif min == 0:
    if hh == 1 or hh == 13:
        print(d_hh[hh][0] + ' ' + 'ровно')
    if 2 <= hh <= 4 or 14 <= hh <= 16:
        print(d_hh[hh][0] + ' ' + 'часа' + ' ' + 'ровно')
    else: 
        print(d_hh[hh][0] + ' ' + 'часов' + ' ' + 'ровно')
    
    