# Напишите программу, которая принимает на вход список чисел и возвращает второе по величине число в списке

g = [8, 26, 7, 13, 32, 4, 9, 16]

g = sorted(g)
print(g[-2])
