g = "Напишите программу, которая принимает строку от пользователя и возвращает количество гласных в строке"
ls = ["е", "э", "а", "я", "у", "ю", "ы", "и", "о", "ё"]
gl = 0
for i in g:
   if i in ls:
      gl = gl + 1
print(gl)