# Напишите программу, которая принимает на вход список чисел и возвращает среднее значение всех чисел в списке.
g = [8, 26, 7, 13, 32, 4, 9, 16]
print(min(g))

x = 0

for i in g:
    if i in g:
        x += i

print(x/len(g))


