# Напишите программу, которая принимает на вход список чисел и возвращает сумму всех четных чисел в списке.
g = [8, 26, 7, 13, 32, 4, 9, 16]
x = 0

for i in g:
    if i % 2 == 0:
        x = x + i
print(x)






