g = "Напишите программу, которая Принимает на вход строку и возвращает строку, в которой все заглавные буквы преобразованы в строчные и наоборот"

g = g.swapcase()
print(g)
